// Задание 3:
// Есть два типа процессов -- корабль и автомобиль, мост разводится когда подплывают два корабля
// Написать два типа программ, одна автомобиль др корабль
// если запущен один корабль, то прога корабль ждет, если два и более, то атомобили ждут корабли
// если кораблей меньще 2 -- автомобили без блокировки
// если кораблей ббольше 2, то блокировка автомобилей, если кораблей больше двух
// мост разводится когда больше 2 кораблей
// сводится -- меньше двух кораблей и есть хотя бы один автомобиль

// sleep